#Написать в одну строчку обращение словаря.
ex_dictionary = {
    'key_1' : 'value_1',
    'key_2' : 'value_2'
}
show_value = ex_dictionary['key_1']
print(show_value)